In [1]:
from bs4 import BeautifulSoup as soup 
import pandas as pd
import pymongo 
import datetime

In [44]:
# Initialize Mongo 
conn = 'mongodb://localhost:27017'
client = pymongo.MongoClient(conn)
db = client.thousand_tabs
collection = db.job_detail
job_links_collection = db.job_links

In [48]:
lnks = pd.DataFrame(list(job_links_collection.find()))

In [3]:
# Load data from our job detail collection in our raw_html_db database
data = pd.DataFrame(list(collection.find()))

In [4]:
link_list = []
for html in data.link_src:
    link_list.append(soup(html,'html.parser'))


# iterate through each sublist of html, parse it, save the result in a tuple then append it to a list as a dict
headers = []
job_titles = []
senority = []
posted = []
employment_type = []
job_function = []

for idx in range(len(link_list)):  
    for x in link_list[idx].find_all('h3','jobs-top-card__company-info t-14 mt1'):
        vitals = x.get_text().replace('Company Name','').replace('Company Location','').split('\n')
        vitals = tuple([elem for elem in vitals if elem.strip()])
        headers.append({'company':vitals[0].strip(),'location':vitals[1].strip()})
    try:
        for title in link_list[idx].find('h1',"jobs-top-card__job-title t-24"):
            job_titles.append(title)
    except:
        job_titles.append(None)
    
    try:
        for x in link_list[idx].find('p','jobs-box__body js-formatted-exp-body'):
            senority.append(x)
    except:
        senority.append(None)
        
  

    try:
        for x in link_list[idx].find_all('p','mt1 full-width flex-grow-1 t-14 t-black--light'):
            posted.append(x.find_all('span')[1].text)
    except:
        posted.append(None)

    try:
        for x in link_list[idx].find('p','jobs-box__body js-formatted-employment-status-body'):
            employment_type.append(x)
    except:
        employment_type.append(None)
    

    try:
        for x in link_list[idx].find_all('li','jobs-box__list-item jobs-description-details__list-item'):
            job_function.append(tuple(idx,x.text()))
    except:


df1 = pd.DataFrame(headers)
df2 = pd.DataFrame(job_titles,columns=['job_title'])
df3= pd.DataFrame(senority,columns=['senority'])
df4= pd.DataFrame(posted,columns=['posted_time'])
df5 = pd.DataFrame(employment_type,columns=['employment_type'])
df6 = pd.DataFrame(job_function, columns=['job_id', 'job_function'])
dataset  = pd.concat([df2,df1,df3,df4,df5],axis=1)
dataset['scrape_time'] = datetime.datetime.now()
dataset.head()

nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah
nah

,job_title,company,location,senority,posted_time,employment_type,scrape_time
0,Supply Chain Data Scientist,Focus GTS,"Thousand Oaks, California, United States",None,Posted 5 days ago,None,2020-04-05 22:16:04.007882
1,Data Analyst,NBS - Local Government Consultants,"Temecula, California",None,Posted 1 week ago,None,2020-04-05 22:16:04.007882
2,Data Scientist,Esri,"Redlands, CA, US",None,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882
3,Data Analyst,TikTok,"Los Angeles, California, United States",Mid-Senior level,Posted 6 days ago,Full-time,2020-04-05 22:16:04.007882
4,Data Analyst,Live Nation Entertainment,"Los Angeles, California, United States",Mid-Senior level,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882

In [14]:
dataset.shape

(803, 9)

In [33]:
dataset['search_query'] = 'data scientist'
dataset['search_location'] = 'greater los angeles area'
test2 = dataset.drop_duplicates(subset=['job_title','company', 'location', 'posted_time'])
test2

,job_title,company,location,senority,posted_time,employment_type,scrape_time,search_query,search_location
0,Supply Chain Data Scientist,Focus GTS,"Thousand Oaks, California, United States",None,Posted 5 days ago,None,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
1,Data Analyst,NBS - Local Government Consultants,"Temecula, California",None,Posted 1 week ago,None,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
2,Data Scientist,Esri,"Redlands, CA, US",None,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
3,Data Analyst,TikTok,"Los Angeles, California, United States",Mid-Senior level,Posted 6 days ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
4,Data Analyst,Live Nation Entertainment,"Los Angeles, California, United States",Mid-Senior level,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
...,...,...,...,...,...,...,...,...,...
798,Data Analyst – Junior,Staffigo,"Pasadena, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
799,Data Analyst – Junior,Staffigo,"Santa Ana, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
800,Data Analyst – Junior,Staffigo,"Anaheim, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
801,Data Analyst – Junior,Staffigo,"Irvine, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
802,Data Analyst – Junior,NaN,NaN,Associate,NaN,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area

In [36]:
tmp = []
for job in range(len(link_list)):
    try:
        for detail in link_list[job].find_all('span','jobs-ppc-criteria__value'):
            tmp.append((job,detail.get_text()))
    except: 
        print('no data here')
        pass

In [54]:
lnks = lnks.reset_index().rename(columns={'index':'job_id'})

In [56]:
tester = lnks.join(dataset,on='job_id')

In [64]:
tester['link'] = tester['link'].map(lambda x: 'www.linkedin.com' + x)

In [68]:
tester

,job_id,_id,link,job_title,company,location,senority,posted_time,employment_type,scrape_time,search_query,search_location
0,0,5e8a98e30150e54cbc999c66,www.linkedin.com/jobs/view/1807757888/?eBP=CwE...,Supply Chain Data Scientist,Focus GTS,"Thousand Oaks, California, United States",None,Posted 5 days ago,None,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
1,1,5e8a98e30150e54cbc999c67,www.linkedin.com/jobs/view/1759871702/?eBP=CwE...,Data Analyst,NBS - Local Government Consultants,"Temecula, California",None,Posted 1 week ago,None,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
2,2,5e8a98e30150e54cbc999c68,www.linkedin.com/jobs/view/1749186522/?eBP=CwE...,Data Scientist,Esri,"Redlands, CA, US",None,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
3,3,5e8a98e30150e54cbc999c69,www.linkedin.com/jobs/view/1806956609/?eBP=JOB...,Data Analyst,TikTok,"Los Angeles, California, United States",Mid-Senior level,Posted 6 days ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
4,4,5e8a98e30150e54cbc999c6a,www.linkedin.com/jobs/view/1795100687/?eBP=JOB...,Data Analyst,Live Nation Entertainment,"Los Angeles, California, United States",Mid-Senior level,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
...,...,...,...,...,...,...,...,...,...,...,...,...
798,798,5e8a98e40150e54cbc999f84,www.linkedin.com/jobs/view/1770432953/?eBP=Not...,Data Analyst – Junior,Staffigo,"Pasadena, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
799,799,5e8a98e40150e54cbc999f85,www.linkedin.com/jobs/view/1770432952/?eBP=Not...,Data Analyst – Junior,Staffigo,"Santa Ana, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
800,800,5e8a98e40150e54cbc999f86,www.linkedin.com/jobs/view/1770435086/?eBP=Not...,Data Analyst – Junior,Staffigo,"Anaheim, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
801,801,5e8a98e40150e54cbc999f87,www.linkedin.com/jobs/view/1770434049/?eBP=Not...,Data Analyst – Junior,Staffigo,"Irvine, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area
802,802,5e8a98e40150e54cbc999f88,www.linkedin.com/jobs/view/1770433646/?eBP=Not...,Data Analyst – Junior,NaN,NaN,Associate,NaN,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area

In [77]:
tester = tester.merge(final_job_skills_index,on='job_id',how='left')

In [78]:
tester[tester.skills.isnull()]

,job_id,_id,link,job_title,company,location,senority,posted_time,employment_type,scrape_time,search_query,search_location,skills
21,2,5e8a98e30150e54cbc999c68,www.linkedin.com/jobs/view/1749186522/?eBP=CwE...,Data Scientist,Esri,"Redlands, CA, US",None,Posted 1 week ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
72,8,5e8a98e30150e54cbc999c6e,www.linkedin.com/jobs/view/1762335528/?eBP=Not...,Data Analyst,"Hill International, Inc.","Pomona, CA, US",Entry level,Posted 4 weeks ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
73,9,5e8a98e30150e54cbc999c6f,www.linkedin.com/jobs/view/1809717639/?eBP=JOB...,Investment Data Analyst,AssetMark,"Encino, CA, US",Entry level,Posted 2 hours ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
74,10,5e8a98e30150e54cbc999c70,www.linkedin.com/jobs/view/1808224049/?eBP=Not...,Data Analyst and Reporting -Culver City,ATMECS Inc,"Culver City, CA, US",Entry level,Posted 4 days ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
75,11,5e8a98e30150e54cbc999c71,www.linkedin.com/jobs/view/1807446781/?eBP=Not...,Data Analyst,Credit Union of Southern California,"Anaheim, CA, US",Entry level,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1374,798,5e8a98e40150e54cbc999f84,www.linkedin.com/jobs/view/1770432953/?eBP=Not...,Data Analyst – Junior,Staffigo,"Pasadena, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
1375,799,5e8a98e40150e54cbc999f85,www.linkedin.com/jobs/view/1770432952/?eBP=Not...,Data Analyst – Junior,Staffigo,"Santa Ana, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
1376,800,5e8a98e40150e54cbc999f86,www.linkedin.com/jobs/view/1770435086/?eBP=Not...,Data Analyst – Junior,Staffigo,"Anaheim, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
1377,801,5e8a98e40150e54cbc999f87,www.linkedin.com/jobs/view/1770434049/?eBP=Not...,Data Analyst – Junior,Staffigo,"Irvine, CA, US",Associate,Posted 1 month ago,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN
1378,802,5e8a98e40150e54cbc999f88,www.linkedin.com/jobs/view/1770433646/?eBP=Not...,Data Analyst – Junior,NaN,NaN,Associate,NaN,Full-time,2020-04-05 22:16:04.007882,data scientist,greater los angeles area,NaN

In [80]:
final_job_skills_index  = pd.DataFrame(tmp,columns=['job_id','skills'])
final_job_skills_index.skills = final_job_skills_index.skills.map(lambda x: x.strip())
final_job_skills_index
# final_job_skills_index.to_csv('../data/skills_indexed.csv')

     job_id                         skills
0         0  Python (Programming Language)
1         0              Analytical Skills
2         0                   Data Science
3         0               Data Integration
4         0      Manufacturing Engineering
..      ...                            ...
634     708             Campaign Analytics
635     708                            DCM
636     708            Marketing Analytics
637     708                      Campaigns
638     708                  Digital Media

[639 rows x 2 columns]

In [9]:
job_function = []
for idx in range(len(link_list)):
    try:
        for x in link_list[idx].find_all('li','jobs-box__list-item jobs-description-details__list-item'):
            job_function.append((idx,x.text))
#             print(tuple(idx, x.get_text))
    except:
        print('nah')
        
        
df6=pd.DataFrame(job_function, columns=['job_id','job_function'])
df6

      job_id                       job_function
0          2                  Computer Software
1          2  Information Technology & Services
2          2                           Internet
3          2                 Project Management
4          2                         Consulting
...      ...                                ...
3144     801             Information Technology
3145     802  Information Technology & Services
3146     802                  Computer Software
3147     802                 Financial Services
3148     802             Information Technology

[3149 rows x 2 columns]

In [10]:
industry = []
for idx in range(len(link_list)):
    try:
        for x in link_list[idx].find_all('li','jobs-box__list-item jobs-description-details__list-item'):
            industry.append((idx,x.text))
#             print(tuple(idx, x.get_text))
    except:
        print('nah')
        
        
df7=pd.DataFrame(job_function, columns=['job_id','industry'])
df7
# link_list[1].find_all('li','jobs-box__list-item jobs-description-details__list-item')

      job_id                           industry
0          2                  Computer Software
1          2  Information Technology & Services
2          2                           Internet
3          2                 Project Management
4          2                         Consulting
...      ...                                ...
3144     801             Information Technology
3145     802  Information Technology & Services
3146     802                  Computer Software
3147     802                 Financial Services
3148     802             Information Technology

[3149 rows x 2 columns]

In [11]:
from sqlalchemy import create_engine
connection_string = 'postgres:postgres@localhost:5432/li_analysis'
engine = create_engine(f'postgresql://{connection_string}')

In [12]:
engine.table_names()

['industry', 'job_function', 'skill', 'job']

In [13]:
df7.to_sql(name='industry', con=engine, if_exists='replace', index=False)
df6.to_sql(name='job_function', con=engine, if_exists='replace', index=False)
final_job_skills_index.to_sql(name='skill', con=engine, if_exists='replace', index=False)
test.to_sql(name='job', con=engine, if_exists='replace', index=False)

NameError: name 'test' is not defined

In [16]:
test = dataset.reset_index().rename(columns={"index": "job_id"})

In [34]:
test2_df = pd.merge(test2.reset_index().rename(columns={"index": "job_id"}), final_job_skills_index, on=['job_id'])

In [35]:
test2_df.to_csv('../data/thousand_dataset.csv')

In [86]:
all_skills = pd.read_csv('../data/all_skills.csv')

In [90]:
master_merge = test.merge(all_skills,on='job_id',how='inner')

In [91]:
master_merge.to_csv('../data/master_merged.csv')